 clear,clc;
 
% 系统参数
r = 0.065/2; %轮半径 m
m = 40/1000; %轮质量 kg
D = 0.19; %两轮距离 
I = 0.5*m*r^2; %轮的转动惯量
M = 780/1000-m*2; %车体的质量
g = 9.8; %重力加速度
l = 0.035; %车体质心到轮毂轴的距离
Jy = M*(D^2+0.08^2)/12; %车体绕y轴的转动惯量
Jz = M*l^2; %车体绕z轴的转动惯量

%参数
a = r*(M+2*m+2*I/(r^2));
b = M*r*l;
c = Jz + M*l^2;
d = M*g*l;
e = M*l;
f = 1/(r*(m*D+I*D/(r^2)+2*Jy/D));

A = [0 1 0 0 0 0;
     0 0 -b*d/(a*c-b*e) 0 0 0;
     0 0 0 1 0 0 ;
     0 0 a*d/(a*c-b*e) 0 0 0;
     0 0 0 0 0 1;
     0 0 0 0 0 0 ];
B = [0 0;
     (c+b)/(a*c-b*e) (c+b)/(a*c-b*e);
     0 0 ;
     -(e+a)/(a*c-b*e) -(e+a)/(a*c-b*e);
     0 0;
     f -f];
 C = [1 0 0 0 0 0;
      0 1 0 0 0 0;
      0 0 1 0 0 0;
      0 0 0 1 0 0;
      0 0 0 0 1 0;
      0 0 0 0 0 1];
  D = [0 0;
      0 0;
      0 0;
      0 0;
      0 0;
      0 0];
% 位移，速度，pitch角度，pitch角速度，yaw角度，yaw角速度
Q = [6100 0 0 0 0 0;
      0 7800 0 0 0 0;
      0 0 18000 0 0 0;
      0 0 0 1800 0 0;
      0 0 0 0 4500 0;
      0 0 0 0 0 1000];
R = [0.7 0;
     0 0.7];

%系统可控性判断
Co=ctrb(A,B);
if(rank(Co)==6)
    %disp('系统可控');
else
    %disp('系统不可控');
end
%系统稳定性分析
[V,D]=eig(A);
y=diag(D);    %系统特征值
K = lqr(A,B,Q,R);
K






























      

